---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionConcreteRectangle
source: html/41507b3f-c1c1-bcc8-6606-fa270c324421.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionConcreteRectangle

Defines parameters for parameterized concrete rectangle structural section.

## Syntax (C#)
```csharp
public class StructuralSectionConcreteRectangle : StructuralSectionRectangular
```